Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeEditFailedError Property
 Slab Shape Edit failed. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeEditFailedError { get; }
Public Shared ReadOnly Property SlabShapeEditFailedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeEditFailedError {
	FailureDefinitionId^ get ();
}
static member SlabShapeEditFailedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace